"""
题目描述：
定义一个字符串为关键串当且仅当该串中出现次数最多的字符严格超过了字符总数
（即串长）的一半。
例如字符串 "a","aab","aaab","abccc" 是关键串，而 "ab","abc","aabb","abcc" 不是。
给一个长度为 n 的字符串 s，有多少个子串是关键串？
子串：对于一个给定的字符串，串中任意个连续的字符组成的子序列称为该串的子串。

输入描述
第一行是一个正整数 n，表示字符串的长度。
第二行是一个长度为 n 的仅包含小写字母的字符串 s。
输出描述
输出一行，表示字符串 s 中是关键串的子串个数。
样例输入
5
ccccb
样例输出
14
提示
14个符合关键串定义的子串分别为"c","c","c","c","b","cc","cc","cc","ccc","ccc",
"ccb","cccc","cccb","ccccb"
1≤n≤100000
"""


# 不会做
n = int(input())
s = input()
dp = [[0] * n for _ in range(n)]
# dp[m][n] = [n,m] 的子串是否符合要求
for i in range(n):
    for _ in range(i, n):
        ...